"Hide %@" = "Hide %@";"Hide Others" = "Hide Others";"Services" = "Services";"Show All" = "Show All";"Quit %@" = "Quit %@";"SMBUp.kEditClear" = "Delete";"Hide %@" = "Hide %@";"Hide Others" = "Hide Others";"Services" = "Services";"Show All" = "Show All";"Quit %@" = "Quit %@";"UtilsModule.currentAppLanguage" = "eng";"Hide %@" = "Hide %@";"Hide Others" = "Hide Others";"Services" = "Services";"Show All" = "Show All";"Quit %@" = "Quit %@";"DownloadAndInstall.isoLanguageCode" = "en";"DownloadAndInstall.DownThread.isoLanguageCode" = "en";"DownloadAndInstall.htskt.isoLanguageCode" = "en";"DownloadAndInstall.LocalTimer.isoLanguageCode" = "en";"DownloadAndInstall.myShell.isoLanguageCode" = "en";"DownloadAndInstall.tempShell.isoLanguageCode" = "en";"DownloadAndInstall.tmPoller.isoLanguageCode" = "en";"Hide %@" = "Hide %@";"Hide Others" = "Hide Others";"Services" = "Services";"Show All" = "Show All";"Quit %@" = "Quit %@";"NSSearchField.ClearSearchesLocalizedText" = "Clear";"NSSearchField.NoRecentSearchesLocalizedText" = "No Recent Searches";"NSSearchField.RecentSearchesLocalizedText" = "Recent Searches";"Hide %@" = "Hide %@";"Hide Others" = "Hide Others";"Services" = "Services";"Show All" = "Show All";"Quit %@" = "Quit %@";"MenuItemEditMenu.LocalizedText" = "Edit";"Hide %@" = "Hide %@";"Hide Others" = "Hide Others";"Services" = "Services";"Show All" = "Show All";"Quit %@" = "Quit %@";"CocoaMenuItemUndo.LocalizedText" = "Undo";"Hide %@" = "Hide %@";"Hide Others" = "Hide Others";"Services" = "Services";"Show All" = "Show All";"Quit %@" = "Quit %@";"CocoaMenuItemCut.LocalizedText" = "Cut";"Hide %@" = "Hide %@";"Hide Others" = "Hide Others";"Services" = "Services";"Show All" = "Show All";"Quit %@" = "Quit %@";"CocoaMenuItemCopy.LocalizedText" = "Copy";"Hide %@" = "Hide %@";"Hide Others" = "Hide Others";"Services" = "Services";"Show All" = "Show All";"Quit %@" = "Quit %@";"CocoaMenuItemPaste.LocalizedText" = "Paste";"Hide %@" = "Hide %@";"Hide Others" = "Hide Others";"Services" = "Services";"Show All" = "Show All";"Quit %@" = "Quit %@";"CocoaMenuItemSelectAll.LocalizedText" = "Select All";"Hide %@" = "Hide %@";"Hide Others" = "Hide Others";"Services" = "Services";"Show All" = "Show All";"Quit %@" = "Quit %@";"CocoaMenuItemEditLink.LocalizedText" = "Link…";"Hide %@" = "Hide %@";"Hide Others" = "Hide Others";"Services" = "Services";"Show All" = "Show All";"Quit %@" = "Quit %@";"MenuItemViewMenu.LocalizedText" = "View";"Hide %@" = "Hide %@";"Hide Others" = "Hide Others";"Services" = "Services";"Show All" = "Show All";"Quit %@" = "Quit %@";"translationStrings.aboutBoxText" = "^appName is an application to automate the installation and management of Samba 3 in Mac OS X Lion, as well as creating and configuring its shared folders.";"translationStrings.AboutMenu" = "&About ^appName...";"translationStrings.HelpMenu" = "^Appname &Help";"translationStrings.BasicHelpText" = "Install or re-install Samba using the options in the application menus.\r\rStaert and stop samba services with the semaphore button at the top.\r\rTo install samba, start and stop the services or make changes to the configuration the application will ask the user to validate as a system administrator.\r\rTo add additional shared drives just drag them from the finder over the main list or select them with the appropriate button.\r\rUse the \"advanced settings\" buttons to modify additional parameters for the server or shared drives.\r\rPlease, use the links below to send any problems or suggestions:";"translationStrings.ClickHereToVisitWebpage" = "Click here to visit webpage";"translationStrings.Clickheretorequestsupportviaemail" = "Click here to request support via email";"translationStrings.ClickheretocontactTwitteraccount" = "Click here to contact Twitter account";"translationStrings.WelcomeToAppLabel" = "Welcome to {AppName}!";"translationStrings.SpecialThanksto" = "Special Thanks to:";"translationStrings.SMBUpQuestion" = "SMBUp Question";"translationStrings.HelpTitle" = "Help";"translationStrings.HelpMenuTitle" = "&Help";"translationStrings.SambaPackages" = "Samba Packages";"translationStrings.ExtraPackages" = "Extra Files";"translationStrings.UninstallRemove" = "Uninstall/Remove";"translationStrings.cancelPrompt" = "Cancel";"translationStrings.OnlyDownload" = "Only Download";"translationStrings.DownloadAndInstallPackage" = "Download && Install Package";"translationStrings.ConfigureSharedDisks" = "Configure Shared Disks";"translationStrings.DownloadingInstaller" = "Installer Download";"translationStrings.SoftwareInstall" = "Software Install";"translationStrings.EnvironmentSetUp" = "Environment Set-Up";"translationStrings.DisablingOriginalServices" = "Disable original services";"translationStrings.GetServiceLaunchScripts" = "Get Service Launch Scripts";"translationStrings.VerifyServiceLaunchScripts" = "Verify Service Launch Scripts";"translationStrings.StartSambaServices" = "Start Samba Services";"translationStrings.OkHelpMeInstall" = "Ok, help me install the software";"translationStrings.ManualInstallURL" = "http://www.johnlarge.co.uk/2011/07/19/osx-lion-samba-smb-shares-broken-xbmc-not-working/";"translationStrings.YouAreRunningThisApplicationInDebug" = "You are running this application in debug testing mode. Please report any bugs to eduo@mac.com";"translationStrings.MainWindowName" = "Main Window";"translationStrings.Closemenu" = "Close";"translationStrings.SelectDirectory" = "Select Directory:";"translationStrings.ShareName" = "Share Name:";"translationStrings.ShareDescription" = "Share Description:";"translationStrings.AllowGuest" = "Allow Guest";"translationStrings.ReadOnlyRO" = "Read Only (RO)";"translationStrings.UpdatePrompt" = "Update";"translationStrings.BasicConfig" = "Basic Config";"translationStrings.AddNewSharedDrive" = "Add new shared drive";"translationStrings.AdvancedSharedDiskSettings" = "Advanced Shared Disk Settings";"translationStrings.AdvancedServerConfiguration" = "Advanced Server Configuration";"translationStrings.InstallorReInstallSamba" = "Install or Re-Install Samba";"translationStrings.BasicInfoHelp" = "Click on the list above to see it\'s details here.\rYou can also create new shared drives by dragging the folder on top of the list or the application icon or by using the \"Add Shared Drive\" button.";"translationStrings.AdvancedSettings" = "Advanced Settings";"translationStrings.Name" = "Name";"translationStrings.Path" = "Path";"translationStrings.Parameter" = "Parameter";"translationStrings.Value" = "Value";"translationStrings.SaveAll" = "Save All";"translationStrings.Description" = "Description";"translationStrings.SambaActiveQ" = "Samba active\?";"translationStrings.SelectADifferentPath" = "Select a Different Path";"translationStrings.ShowinFinder" = "Show in Finder";"translationStrings.SharedDriveDetails" = "Shared Drive Details";"translationStrings.ServerDetails" = "Server Details";"translationStrings.Stop" = "Stop";"translationStrings.Start" = "Start";"translationStrings.Install" = "Install";"translationStrings.ReInstallSamba" = "Re-Install Samba";"translationStrings.UninstallSamba" = "Uninstall Samba";"translationStrings.File" = "File";"translationStrings.Actions" = "Actions";"translationStrings.Edit" = "Edit";"translationStrings.Help" = "Help";"translationStrings.Window" = "Window";"translationStrings.Undo" = "Undo";"translationStrings.Cut" = "Cut";"translationStrings.Copy" = "Copy";"translationStrings.Paste" = "Paste";"translationStrings.SelectAll" = "Select All";"translationStrings.Reset" = "Reset";"translationStrings.ReSetConfigurationFileQ" = "Re-set configuration file\?";"translationStrings.YouAlreadyHaveAnExistingConfig" = "You already seem to have an existing configuration for Samba. You can keep it or re-set all values to default ones.";"translationStrings.ReSetWithDefaultValues" = "Re-Set with default values";"translationStrings.KeepExistingConfigFile" = "Keep existing config file";"translationStrings.WeWillNowSendTheDownloadURL" = "We will now send the download URL to your default web browser. This application will then quit to allow you to download and install the package. Please start the application again once you\'ve completed the installation.";"translationStrings.PleaseSelectOnlyOneFolder" = "Please select only one folder…";"translationStrings.TheresBeenAnErrorLoadingTheConfigurationValues" = "There\'s been an error loading the configuration values.";"translationStrings.CouldntFindAnInstallerVersionOfSamba" = "Couldn\'t find an installed version of Samba. The program will now quit.";"translationStrings.ThereWasAnErrorLoadingTheDefaultConfiguration" = "There was an error loading the default configuration. The program will now quit.";"translationStrings.ThereWasAnErrorSavingYourConfigurationFile" = "There was an error saving your configuration file.";"translationStrings.SambaIsNotInstalled" = "Samba is not installed. The program will now quit.";"translationStrings.SambaScriptsNotInstalled" = "Samba scripts not installed";"translationStrings.SambaSeemsToBeInstallerButNoLaunchScriptsArePresent" = "Samba seems to be installed but no launch scripts are present. This application can create the required launch scripts, but it\'s designed to work with its own installed version. A re-install is recommended.";"translationStrings.CreateSambaScripts" = "Create Samba Scripts";"translationStrings.InstallSambaForMe" = "Install Samba for me";"translationStrings.InstallManually" = "Install manually";"translationStrings.UnknownSambaInstallation" = "Unknown Samba installation";"translationStrings.SambaNotInstalled" = "Samba not installed";"translationStrings.SambaSeemsToBePresentButItHasntBeenInstalledInAWay" = "Samba seems to be present but it hasn\'t been installed in a way this application can understand. This application can only work reliably with its own installed versions.";"translationStrings.SambaIsNotPresent" = "Samba is not present in this system. You won\'t be able to use the application until it\'s installed properly. You can decide to install samba manually yourself or allow this application to assist you with this action.";"translationStrings.UnsavedChanges" = "Unsaved changes";"translationStrings.ThereHaveBeenChangesMade" = "There have been changes made to the server or shared drive configuration that are still unsaved. Do you want to save these changes before quitting, review the configuration or quit without saving\?";"translationStrings.SaveChangesAndQuitApplication" = "Save Changes && Quit Application";"translationStrings.ReviewConfiguration" = "Wait for Service";"translationStrings.QuitWithoutSaving" = "Quit Without Saving";"translationStrings.SambaIsNotRunning" = "Samba is not running";"translationStrings.SambaDoesntSeemToBeRunning" = "Samba doesn\'t seem to be running. Remember to start the service before closing the application if you want to use the Samba service.";"translationStrings.StartSambaServiceForMe" = "Start Samba Service for me && Quit application";"translationStrings.CancelQuit" = "Cancel Quit";"translationStrings.QuitApplication" = "Quit Application";"translationStrings.PleaseWaitWhileTheSystemLoadsCurrentData" = "Please, wait while the system loads current data…";"translationStrings.FilesWithinABundleCantBeMadeIntoAShareDrive" = "Files within a bundle can\'t be made into a share drive";"translationStrings.DropItemForReadWrite" = "Drop item here to create new Read/Write share";"translationStrings.DropItemForReadOnly" = "Drop item here to create new Read-Only share";"translationStrings.DragOnlyOneItem" = "Drag only one item to add a new share";"translationStrings.YouAreAboutToDeleteYourOnlySharedDrive" = "You are about to delete your only shared drive definition. Please confirm, as you can\'t undo this action.";"translationStrings.YouAreAboutToDeleteOneOfYourSharedDrives" = "You are about to delete one of your shared drive definitions. Please confirm, as you can\'t undo this action";"translationStrings.CouldntConnectToTheInternet" = "Couldn\'t connect to the Internet. Please check your network connection and try again. The application will quit now.\"";"translationStrings.DeleteSharedDrive" = "Delete shared drive ";"translationStrings.ManageSambaandSambaSharedDrives" = "Manage Samba and Samba Shared Drives";"translationStrings.AllInstalled" = "All Installed";"translationStrings.SelectedItemsUninstalled" = "Selected items uninstalled. The application will now quit.";"translationStrings.DownloadComplete" = "Download Complete";"translationStrings.Downloaded" = "Downloaded";"translationStrings.PreparingToInstall" = "Preparing to install…";"translationStrings.AuthenticationCancelledCommandsWillNowStop" = "Authentication cancelled. Commands will now stop.";"translationStrings.MountingSamba3InstallerDiskImage" = "Mounting Samba3 Installer Disk Image…";"translationStrings.Samba3InstallerDiskImageIsReady" = "Samba3 Installer Disk Image is ready";"translationStrings.GettingDownloadLink" = "Getting Download Link…";"translationStrings.Donate" = "Donate";"translationStrings.donatePleaLetter" = "A year after Mac OS X Lion was released no samba replacement had been issued by anyone, so I set out to do it. The idea was to do it and sell in on the Mac App Store, but this wasn\'t possible due to incompatibilities between Samba and the Mac App Store.\r\rThis means this application is being provided as DonationWare. Basically, if you like it and it\'s useful to you, you get to donate whatever amount you want and feel good about yourself. This in turn will allow me to continue improving it and developing further applications.\r\rUse the options below to complete your donation and tell the application you\'ve already done so.\r\rThank you.";"translationStrings.IveDonated" = "I\'ve Donated!";"translationStrings.RemoveSharedHomes" = "Remove Shared Homes";"translationStrings.CreateSharedHomes" = "Create Shared Homes";"translationStrings.ManageUsers" = "Manage Users";"translationStrings.ResetConfigFile" = "Reset Config Files";"translationStrings.StartStopSamba" = "Start/Stop Samba";"translationStrings.updateLabelText" = "Update Available!";"translationStrings.usersButtonText" = "Users";"translationStrings.UsernameText" = "Username";"translationStrings.PasswordText" = "Type Password";"translationStrings.RepeatPasswordText" = "Repeat Password";"translationStrings.ShowPasswordText" = "Show Password";"translationStrings.ChangePasswordText" = "Change Password";"translationStrings.CloseText" = "Close";"translationStrings.AddUserText" = "Add User";"translationStrings.DeleteUserText" = "Delete User";"translationStrings.userHasWayTooManyGroups" = ": User has more than 15 groups assigned to it by Mac OS X. This has been known to cause problems with this implementation of Samba when run under OS X Lion. You will be able to create the account, but access may not be possible until some of the group accesses are removed. Alternatively, consider using a different user account or creating ad-hoc accounts just for file sharing.";"translationStrings.ResetOSXServices" = "There\'s an error starting the Samba service. This may be related to processes running incompatible with it. You can choose to quit the application, keep waiting and/or troubleshooting the system yourself or you can let SMBUp reset the set-up to try and restart Samba";"translationStrings.ErrorStartingTheService" = "Error starting the service";"translationStrings.thanksDonation" = "Thank you!";"Hide %@" = "Hide %@";"Hide Others" = "Hide Others";"Services" = "Services";"Show All" = "Show All";"Quit %@" = "Quit %@";"StringHelpers.MacPortsInstalledText" = "There seem to be some packages installed by MacPorts in your system. They have been unselected by default. You should use MacPorts to uninstall them.";"Hide %@" = "Hide %@";"Hide Others" = "Hide Others";"Services" = "Services";"Show All" = "Show All";"Quit %@" = "Quit %@";"DownloadAndInstall1.isoLanguageCode" = "en";"DownloadAndInstall1.DownThread.isoLanguageCode" = "en";"DownloadAndInstall1.htskt.isoLanguageCode" = "en";"DownloadAndInstall1.LocalTimer.isoLanguageCode" = "en";"DownloadAndInstall1.myShell.isoLanguageCode" = "en";"DownloadAndInstall1.tempShell.isoLanguageCode" = "en";"DownloadAndInstall1.tmPoller.isoLanguageCode" = "en";"Hide %@" = "Hide %@";"Hide Others" = "Hide Others";"Services" = "Services";"Show All" = "Show All";"Quit %@" = "Quit %@";"MenuItemFileMenu.LocalizedText" = "File";"Hide %@" = "Hide %@";"Hide Others" = "Hide Others";"Services" = "Services";"Show All" = "Show All";"Quit %@" = "Quit %@";"CocoaMenuItemClose.LocalIzedText" = "Close";"Hide %@" = "Hide %@";"Hide Others" = "Hide Others";"Services" = "Services";"Show All" = "Show All";"Quit %@" = "Quit %@";"CocoaMenuItemPrint.LocalizedText" = "Print…";"Hide %@" = "Hide %@";"Hide Others" = "Hide Others";"Services" = "Services";"Show All" = "Show All";"Quit %@" = "Quit %@";"CocoaMenuItemPageSetup.LocalizedText" = "Page Setup…";